In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.DataFrame([[90, 60, 33], [50, 70, 75], [70, 90, 88], [80, 50, 60]], index=['Simon','Allen','Jimmy','Peter'], columns = ['Math', 'English', 'History'])
data

       Math  English  History
Simon    90       60       33
Allen    50       70       75
Jimmy    70       90       88
Peter    80       50       60

In [3]:
data[data['Math']>60]
data[data['English']>85]

       Math  English  History
Jimmy    70       90       88

In [4]:
data.mean()

Math       72.5
English    67.5
History    64.0
dtype: float64

In [5]:
data_Math = data.drop(columns=['English','History'],axis=1)
data_Math.sort_values(by='Math')

       Math
Allen    50
Jimmy    70
Peter    80
Simon    90

In [6]:
data_English = data.drop(columns=['Math','History'],axis=1)
data_English.sort_values(by='English')

       English
Peter       50
Simon       60
Allen       70
Jimmy       90

In [7]:
data_History = data.drop(columns=['Math','English'],axis=1)
data_History.sort_values(by='History')

       History
Simon       33
Peter       60
Allen       75
Jimmy       88

In [8]:
data['Gender'] = ['M','F','M','M']
data

       Math  English  History Gender
Simon    90       60       33      M
Allen    50       70       75      F
Jimmy    70       90       88      M
Peter    80       50       60      M

In [9]:
data.loc[:,'Gender'].value_counts()

M    3
F    1
Name: Gender, dtype: int64

In [10]:
data = data.drop('Gender',axis=1)
data['mean'] = (data['Math']+data['English']+data['History'])/3
data.sort_values(by='mean')

       Math  English  History       mean
Simon    90       60       33  61.000000
Peter    80       50       60  63.333333
Allen    50       70       75  65.000000
Jimmy    70       90       88  82.666667

In [11]:
data =data.mean(axis=1)
data.rank(ascending=False)

Simon    4.0
Allen    2.0
Jimmy    1.0
Peter    3.0
dtype: float64